oracle/solaris-userland/components/ntp/manpages/ntpd.8
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009, 2022, Oracle and/or its affiliates.
.\"
.TH "ntpd" "8" "" "" "System Administration Commands"
.SH NAME
ntpd \- Network Time Protocol daemon Version 4
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/ntpd\fR [\fB-46aAbdDgiILmnNqvx\fR] [\fB-c\fR \fIconffile\fR]
    [\fB-f\fR \fIdriftfile\fR] [\fB-i\fR \fIjaildir\fR] [\fB-k\fR \fIkeyfile\fR] [\fB-l\fR \fIlogfile\fR]
    [\fB-p\fR \fIpidfile\fR] [\fB-P\fR \fIpriority\fR] [\fB-r\fR \fIbroadcastdelay\fR]
    [\fB-s\fR \fIstatsdir\fR] [\fB-t\fR \fItrustedkey\fR] [\fB-u\fR \fIuser\fR[:\fIgroup\fR]]
    [\fB-U\fR \fIinterface_update_time\fR] [\fB--var\fR \fInvar\fB] [\fB--dvar\fR \fIndvar\fR]
.fi

.SH DESCRIPTION
The \fBntpd\fR program is an operating system daemon that synchronizes the system clock with remote NTP time servers or local reference clocks. It is a complete implementation of the Network Time Protocol (\fBNTP\fR) version 4, but also retains compatibility with version 3, as defined by \fIRFC 1305\fR, and versions 1 and 2, as defined by \fIRFC 1059\fR and \fIRFC 1119\fR, respectively.
.SS How \fBNTP\fR Operates
The \fBntpd\fR program operates by exchanging messages with one or more configured servers at designated intervals ranging from about one minute to about 17 minutes. When started, the program requires several exchanges while the algorithms accumulate and groom the data before setting the clock. The initial delay to set the clock can be reduced using options as described in the server options page  at file:///usr/share/doc/ntp/confopt.html.
.LP
When the machine is booted, the hardware time of day (TOD) chip is used to initialize the operating system time. After the machine has synchronized to a \fBNTP\fR server, the operating system corrects the chip from time to time. During the course of operation if for some reason the system time is more than 1000s offset from the server time, \fBntpd\fR assumes something must be terribly wrong and exits with a panic message to the system log. If it was started via SMF, the ntp service is placed into maintenance mode and must be cleared manually. The -g option overrides this check at startup and allows \fBntpd\fR to set the clock to the server time regardless of the chip time, but only once.
.LP
Under ordinary conditions, \fBntpd\fR slews the clock so that the time is effectively continuous and never runs backwards. If due to extreme network congestion an error spike exceeds the \fIstep threshold\fR (128ms by default), the spike is discarded. However, if the error persists for more than the \fIstepout threshold\fR (900s by default) the system clock is stepped to the correct value. In practice the need for a step is extremely rare and almost always the result of a hardware failure. With the -x option the step threshold is increased to 600s. Other options are available using the \fItinker\fR command as described in the miscellaneous options page at file:///usr/share/doc/ntp/miscopt.html.
.LP
The issues should be carefully considered before using these options. The maximum slew rate possible is limited to 500 parts-per-million (PPM) by the Unix kernel. As a result, the clock can take 2000s for each second the clock is outside the acceptable range. During this interval the clock will not be consistent with any other network clock and the system cannot be used for distributed applications that require correctly synchronized network time.
.LP
.SS Frequency Discipline
The frequency file, usually called ntp.drift, contains the latest estimate of clock frequency. If this file does not exist when ntpd is started, it enters a special mode designed to measure the particular frequency directly. The measurement takes 15 minutes, after which the frequency is set and ntpd resumes normal mode where the time and frequency are continuously adjusted. The frequency file is updated at intervals of an hour or more depending on the measured clock stability.
.SS Operating Modes
The \fBntpd\fR daemon can operate in any of several modes, including symmetric active/passive, client/server broadcast/multicast and manycast, as described in the Association Management page at file:///usr/share/doc/ntp/assoc.html. It normally operates continuously while monitoring for small changes in frequency and trimming the clock for the ultimate precision. However, it can operate in a one-time mode where the time is set from an external server and frequency is set from a previously recorded frequency file. A broadcast/multicast or manycast client can discover remote servers, compute server-client propagation delay correction factors and configure itself automatically. This makes it possible to deploy a fleet of workstations without specifying configuration details specific to the local environment.
.LP
By default, \fBntpd\fR runs in continuous mode where each of possibly several external servers is polled at intervals determined by an intricate phase/frequency-lock feedback loop. The feedback loop measures the incidental round-trip delay jitter and oscillator frequency wander and determines the best poll interval using a heuristic algorithm. Ordinarily, and in most operating environments, the state machine will start with 64s intervals and eventually increase in steps to 1024s. A small amount of random variation is introduced in order to avoid bunching at the servers. In addition, should a server become unreachable for some time, the poll interval is increased in steps to 1024s in order to reduce network overhead. In general it is best not to force \fBntpd\fR to use specific poll intervals, allowing it to choose the best intervals based its current needs and the quality of the available servers and the clock.
.LP
In some cases it may not be practical for \fBntpd\fR to run continuously. In the past a common workaround has been to run the \fBntpdate\fR program from a cron job at designated times. However, \fBntpdate\fR does not have the crafted signal processing, error checking and mitigation algorithms of \fBntpd\fR. The \fBntpd\fR daemon with -q option is intended to replace \fBntpdate\fR when used in this manner. Setting this option will cause \fBntpd\fR to exit just after setting the clock for the first time. The procedure for initially setting the clock is the same as in continuous mode; most applications will probably want to specify the iburst keyword with the server configuration command. With this keyword a volley of messages are exchanged to groom the data and the clock is set in about 10s. If nothing is heard after a couple of minutes, the daemon times out and exits. Eventually the \fBntpdate\fR program may be retired.
.SS Kernel Clock Discipline
The kernel supports a method specific to \fBntpd\fR to discipline the clock frequency. First, \fBntpd\fR is run in continuous mode with selected servers in order to measure and record the intrinsic clock frequency offset in the frequency file. It may take some hours for the frequency and offset to settle down. Then \fBntpd\fR is run in normal mode as required. At each startup, the frequency is read from the file and initializes the kernel frequency, thus avoiding the settling period.
When the kernel discipline is in use, the system's clock is adjusted at each system tick and thus the system clock is always as accurate as possible. When the kernel discipline is not used the clock is adjusted once each second. It is important to delete the ntp.drift file before starting \fBntpd\fR if the intrinsic frequency might have changed, such as by a motherboard swap.
.SS Poll Interval Control
The \fBntpd\fR program includes an intricate clock discipline to reduce the network
load while maintaining a quality of synchronization consistent with the observed
jitter and wander. There are a number of ways to tailor the operation in order to enhance
accuracy by reducing the interval or to reduce network overhead by increasing it. However, the user is advised to carefully consider the consequences of changing the poll adjustment range from the default. It is not the case that shorter poll intervals will necessarily
lead to more accuracy. Most device drivers will not operate properly if the poll interval is less than 64 s and that the broadcast server and manycast client associations will also use the default, unless overridden. In general, it is best to let \fBntpd\fR determine the best polling interval.
.LP
In some cases involving dial up or toll services, it may be useful to increase the minimum interval to a few tens of minutes and maximum interval to a day or so. Under normal operation conditions, once the clock discipline loop has stabilized the interval will be increased in steps from the minimum to the maximum. However, this assumes the intrinsic clock frequency error is small enough for the discipline loop correct it. The capture range of the loop is 500 PPM at an interval of 64s decreasing by a factor of two for each doubling of interval. At a minimum of 1,024 s, for example, the capture range is only 31 PPM.
.SS The Huff-n'-Puff Filter
In scenarios where a considerable amount of data are to be downloaded or uploaded over bandwidth limited links, timekeeping quality can be seriously degraded due to the different delays in the two directions. In many cases the apparent time errors are so large as to exceed the step threshold and a step correction can occur during and after the data transfer is in progress.
.LP
The huff-n'-puff filter is designed to correct the apparent time offset in these cases. It depends on knowledge of the propagation delay when no other traffic is present. The filter maintains a shift register that remembers the minimum delay over the most recent interval measured usually in hours. Under conditions of severe delay, the filter corrects the apparent offset using the sign of the offset and the difference between the apparent delay and minimum delay. The name of the filter reflects the negative (huff) and positive (puff) correction, which depends on the sign of the offset.
.LP
The filter is activated by the tinker command and huffpuff keyword, as described in the Miscellaneous Options page at file:///usr/share/doc/ntp/miscopt.html.
.SS Leap Second Processing
As provided by international agreement, an extra second is sometimes inserted in Coordinated Universal Time (UTC) at the end of a selected month, usually June or December. The National Institutes of Standards and Technology (NIST) provides an historic leapseconds file at time.nist.gov for retrieval via FTP. This file, usually called ntp-leapseconds.list, is copied into the /etc/inet directory and the leapfile configuration command then specifies the path to this file. At startup, ntpd reads it and initializes three leapsecond values: the NTP timestamp at the next leap event, the offset of UTC relative to International Atomic Time (TAI) after the leap and the NTP timestamp when the leapseconds file expires and should be retrieved again.
.LP
If a host does not have the leapsecond values, they can be obtained over the net using the Autokey security protocol. Ordinarily, the leapseconds file is installed on the primary servers and the values flow from them via secondary servers to the clients. When multiple servers are involved, the values with the latest expiration time are used.
.LP
If the latest leap is in the past, nothing further is done other than to install the TAI offset. If the leap is in the future less than 28 days, the leap warning bits are set. If in the future less than 23 hours, the kernel is armed to insert one second at the end of the current day. Additional details are in The NTP Timescale and Leap Seconds white paper at http://www.eecis.udel.edu/~mills/leap.html.
.LP
If none of the above provisions are available, dependent servers and clients tally the leap warning bits of surviving servers and reference clocks. When a majority of the survivors show warning, a leap is programmed at the end of the current month. During the month and day of insertion, they operate as above. In this way the leap is is propagated at all dependent servers and clients.
.SS Monitor Mode
In addition to the default instance of NTP (\fBsvc:/network/ntp:default\fR) which behaves normally,  there is second instance (\fBsvc:/network/ntp:monitor\fR) which can be used
to monitor the system clock. It has the same effect as adding "disable ntp" to the configuration file, which disables ntpd's ability to
adjust the system clock. It can then be used to monitor and record the system clock offsets but will not be able to correct them. When
enabled it also disables the check in both the NTP and PTP services that prevent them from both running at the same time. Thus
ntp:monitor can be used to measure the clock offsets being set by PTP.
.LP
.SH OPTIONS
.TP
.BR \-4 ", " \--ipv4
Force DNS resolution of following host names on the command line
to the IPv4 namespace. Cannot be used with the \fB--ipv6\fR option.
.TP
.BR \-6 ", " \--ipv6
Force DNS resolution of following host names on the command line
to the IPv6 namespace. Cannot be used with the \fB--ipv6\fR option.
.TP
.BR \-a ", " \--authreq
Require cryptographic authentication for broadcast client,
multicast client and symmetric passive associations.
This is the default.
This option must not appear with authnoreq option.
.TP
.BR \-A ", " \--authnoreq
Do not require cryptographic authentication for broadcast client,
multicast client and symmetric passive associations.
This is almost never a good idea. This option must not appear with the authreq option.
.TP
.BR \-b ", " \--bcastsync
Enable the client to sync to broadcast servers.
.sp
.TP
.BR \-c " \fIstring\fP, " \--configfile "=" \fIstring\fP
The name and path of the configuration file,
/etc/inet/ntp.conf by default. This file must be readable by the user "daemon".
If the file does not exist the \fBNTP\fP service will not start.
.TP
.BR \-d ", " \--debug-level
Increase output debug message level.
This option may appear an unlimited number of times.
.TP
.BR \-D " \fIstring\fP, " \--set-debug-level "=" \fIstring\fP
Set the output debugging level.  Can be supplied multiple times,
but each overrides the previous value(s).
.TP
.BR \-f " \fIstring\fP, " \--driftfile "=" \fIstring\fP
The name and path of the frequency file,
/var/ntp/ntp.drift by default.
.TP
.BR \-g ", " \--panicgate
Allow the first adjustment to exceed the panic limit.
.sp
Normally,
\fBntpd\fR
exits with a message to the system log if the offset exceeds the panic threshold, which is 1000s by default. This option allows the time to be set to any value without restriction; however, this can happen only once. If the threshold is exceeded after that,
\fBntpd\fR
will exit with a message to the system log. This option can be used with the
-q
and
-x
options.
See the
tinker
configuration file directive for other options.
.TP
.BR \-i " \fIjaildir\fP, " \--jaildir "=" \fIstring\fP
Specify a directory where ntpd can be isolated with the chroot call.
.TP
.BR \-k " \fIstring\fP, " \--keyfile "=" \fIstring\fP
Specify the name and path of the symmetric key file.
/etc/inet/ntp.keys
is the default.
.TP
.BR \-l " \fIstring\fP, " \--logfile "=" \fIstring\fP
Specify the name and path of the log file.
The default is the system log file. If logging is enabled to the logfile, the
logfile must be in a directory that is writable by the user "daemon" and if the
file already exists, it also must be writeable by the user "daemon".
.TP
.BR \-L ", " \--novirtualips
Do not listen to virtual IPs. The default is to listen.
.TP
.BR \-m ", " \--mdns
Register as a NTP server with mDNS system. Implies that you are willing to serve time to others.
.TP
.BR \-n ", " \--nofork
Do not fork.
.sp
.TP
.BR \-N ", " \--nice
To the extent permitted by the operating system, run
\fBntpd\fR
at the highest priority.
.TP
.BR \-p " \fIstring\fP, " \--pidfile "=" \fIstring\fP
Specify the name and path of the file used to record
\fBntpd\fR's
process ID.
.TP
.BR \-P " \fInumber\fP, " \--priority "=" \fInumber\fP
To the extent permitted by the operating system, run
\fBntpd\fR
at the specified
sched_setscheduler(SCHED_FIFO)
priority.
.TP
.BR \-q ", " \--quit
Set the time and quit.
\fBntpd\fR
will exit just after the first time the clock is set. This behavior mimics that of the
\fBntpdate\fR
program, which is to be retired.
The
-g
and
-x
options can be used with this option.
Note: The kernel time discipline is disabled with this option.
.TP
.BR \-r " \fIstring\fP, " \--propagationdelay "=" \fIstring\fP
Specify the default propagation delay from the broadcast/multicast server to this client. This is necessary only if the delay cannot be computed automatically by the protocol.
.TP
.BR \-s " \fIstring\fP, " \--statsdir "=" \fIstring\fP
Specify the directory path for files created by the statistics facility. This is the same operation as the statsdir command.
.TP
.BR \-t " \fInumber\fP, " \--trustedkey "=" \fInumber\fP
Add a key number to the trusted key list. This option can occur more than once. This is the same operation as the trustedkey key command.
.TP
.BR \-u " \fIuser[:group]\fP, " \--user "=" \fIstring\fP
Specify a user, and optionally a group, to switch to.
.TP
.BR \-U " \fInumber\fP, " \--updateinterval "=" \fInumber\fP
interval in seconds between scans for new or dropped interfaces.
This option takes an integer number as its argument.
.sp
Give the time in seconds between two scans for new or dropped interfaces.
For systems with routing socket support the scans will be performed shortly after the interface change
has been detected by the system.
Use 0 to disable scanning. 60 seconds is the minimum time between scans.
.TP
.BR \--var "=" \fInvar\fP
make ARG an ntp variable (RW).
This option may appear an unlimited number of times.
.sp
.TP
.BR \--dvar "=" \fIndvar\fP
make ARG an ntp variable (RW|DEF).
This option may appear an unlimited number of times.
.sp
.TP
.BR \-x ", " \--slew
Slew up to 600 seconds.
.sp
Normally, the time is slewed if the offset is less than the step threshold, which is 128 ms by default, and stepped if above the threshold.
This option sets the threshold to 600 s, which is well within the accuracy window to set the clock manually.
Note: Since the slew rate of typical Unix kernels is limited to 0.5 ms/s, each second of adjustment requires an amortization interval of 2000 s.
Thus, an adjustment as much as 600 s will take almost 14 days to complete.
This option can be used with the
-g
and
-q
options.
See the
tinker
configuration file directive for other options.
Note: The kernel time discipline is disabled with this option.
.TP
.BR \-? , " \--help"
Display usage information and exit.
.TP
.BR \-! , " \--more-help"
Extended usage information passed thru pager.
.TP
.BR " \--version"
Output version of program and exit.
.SH OPTION PRESETS
All of the above options except the last three may be preset
by loading values from environment variables named:
.nf
  \fBNTPD_<option-name>\fP or \fBNTPD\fP
.fi
.aj
The environmental presets take precedence (are processed later than)
the configuration files. The option-name should be in all capital letters.
For example, to set the --quit option, you would set the NTPD_QUIT environment
variable.
.SH AUTOMATIC SERVICE MANAGEMENT (SMF)
\fBNTP\fR on Solaris is managed via the service management facility described in
\fBsmf\fR(7). There are several options controlled by services properties which
can be set by the system administrator. The available options can be listed by
executing the following command:
.nf
	svccfg -s svc:/network/ntp:default listprop config
.fi
.aj
Each of these properties can be set using this command:
.nf
	svccfg -s  svc:/network/ntp:default setprop \fIpropname\fP = \fIvalue\fP
.fi
.aj
The available options and there meaning are as follows:
.TP
.BR config/always_allow_large_step
A boolean which when false, prevents ntpd from allowing step larger than 17 minutes except once
when the system boots. The default is true, which allows such a large step once each time ntpd starts.
.TP
.BR config/debuglevel
An integer specifying the level of debugging requested. A zero means no debugging. The default is zero.
.TP
.BR config/logfile
A string specifying the location of the file used for log output. The default is /var/ntp/ntp.log. The
log file must be writable by the user "daemon" and must be in a directory writeable by that user.
.TP
.BR config/no_auth_required
A boolean which when true, specifies that anonymous servers such as broadcast, multicast and active peers
can be accepted without any pre-configured keys. This is very insecure and should only be used if
the network is secure and all the systems on it are trusted. The default is false.
.TP
.BR config/slew_always
A boolean which when true, instructs ntpd to slew the clock as much as possible, instead of stepping the clock. It
does not prevent all stepping, but increases the threshold above which stepping is used. It also disables the use
of the kernel \fBNTP\fP facility, which is incompatible with long slew times. The default is false.
.TP
.BR config/allow_step_at_boot
A boolean which when true, allows ntpd to step the clock once at boot, even if slew_always is true. Normally
when slew_always is true ntpd will not step the clock except for very large offsets. Since the initial offset
when the system is booted could be large and no applications will be running yet, this option allows one step
as soon as the offset is determined. If slew_always is false or if the \fBNTP\fP service is being restarted, then
this option has no effect. The default is true.
.TP
.BR config/wait_for_sync
A boolean which when true, causes the \fBNTP\fP service to delay coming completely on-line until after the first
time the system clock is synchronized. This can potentially delay the system start up by a significant amount. The
default is false.
.TP
.BR config/disable_local_time_adjustment
A boolean which when true, causes the \fBNTP\fP service to be run without the privilege to adjust the system clock. When false the privilege is
required to be present, otherwise the daemon will not start. The default is false.
.TP
.BR config/mdnsregister
A boolean which when true, will cause the daemon to register with the network mDNS system. The default is false.
.TP
.BR config/verbose_logging
A boolean which when true, cause the daemon to issue logging messages. The default is false.
.TP
.BR config/no_2038
A boolean which when true will prevent the daemon from stepping the clock to any date in the year 2038 or later. Dates after
the epoch rollover in Feburary 2038 can render the system unstable if 32-bit system processes are in use. In some configurations
the instability may persist after the problem is corrected. The default is true.
.SH NOTES
The system clock must be set to within 68 years of the actual time before \fBntpd\fR is started.
.LP
The \fBntpd\fR service is managed by the service management facility, \fBsmf\fR(7), under the service identifier:
.sp
.in +2
.nf
svc:/network/ntp:default
.fi
.in -2
.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(8). The service's status can
be queried using the \fBsvcs\fR(1) command.
.sp
In contexts where a host name is expected, a -4 qualifier preceding the host name forces DNS resolution to the IPv4 namespace, while a -6 qualifier forces DNS resolution to the IPv6 namespace.
.LP
Various internal \fBntpd\fR variables can be displayed and configuration options altered while the \fBntpd\fR is running using the \fBntpq\fR utility program.
.LP
When \fBntpd\fR starts it looks at the value of umask, and if zero \fBntpd\fR will set the umask to 022.
.LP
The documentation available at /usr/share/doc/ntp is provided as is from the
\fBNTP\fR distribution and may contain information that is not applicable to
the software as provided in this particular distribution.
.LP
The ntpd daemon now runs as the user "daemon". Care must be taken if it is
configured to read or write files other than in the directories /etc/inet and
/var/ntp. Any other locations will require that the user daemon have the proper
permissions to access the files.
.LP
There are two example configuration files provided, /etc/inet/ntp.client and
/etc/inet/ntp.server. The first provides examples and some discussion around
the configuration information that goes into the /etc/inet/ntp.conf file. The
second focuses exclusively on the configuration of hardware clocks for stratum
zero servers and can be ignored by most users.
.PP
.SH EXAMPLES
.LP
The simplest way to start using the \fBNTP\fP service on a new host is to run
the command:
.sp
.in +2
.nf
echo 'server hostname iburst' > /etc/inet/ntp.conf
.fi
.in -2
.LP
and then start the service. Replace 'hostname' with the actual hostname of an
NTP server. You can add more lines like this one with the hostnames of more
NTP servers.
.PP
.SH CAVEATS
.LP
You can add as many servers as you like but only \fImaxclock\fR (default 10) servers
will actually be used. Do not configure exactly two. Four servers is optimal, but
never use two. If for some reason you only have two and you must have redundancy
put the \fBprefer\fR keyword on one of the server lines to mitigate most of the
problems with using two servers.
.PP
.SH SEE ALSO
.LP
\fBsvcs\fR(1), \fBsntp\fR(8), \fBntp-keygen\fR(8), \fBntpdate\fR(8), \fBntpq\fR(8), \fBntptrace\fR(8), \fBntptime\fR(8), \fBsvcadm\fR(8), \fBrename\fR(2), \fBattributes\fR(7), \fBsmf\fR(7)

