/*
 * Copyright (c) 2012, Oracle and/or its affiliates. All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice (including the next
 * paragraph) shall be included in all copies or substantial portions of the
 * Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL
 * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 */

#ifndef _MGA_H
#define	_MGA_H

/* BEGIN CSTYLED */

	/* MGA PCI Specific Registers */

#define	MGAPCI_AGP_CMD					      0xf8
#define	MGAPCI_AGP_IDENT				      0xf0
#define	MGAPCI_AGP_STS					      0xf4
#define	MGAPCI_FB_BASE					      0x10
#define	MGAPCI_CONTROL_BASE				      0x14

#define	MGAINDEX_DRAW_AR0				      0x58
#define	MGAINDEX_DRAW_AR1				      0x59
#define	MGAINDEX_DRAW_AR2				      0x5a
#define	MGAINDEX_DRAW_AR3				      0x5b
#define	MGAINDEX_DRAW_AR4				      0x5c
#define	MGAINDEX_DRAW_AR5				      0x5d
#define	MGAINDEX_DRAW_AR6				      0x5e
#define	MGAINDEX_DRAW_CXBNDRY				      0x60
#define	MGAINDEX_DRAW_FXBNDRY				      0x61
#define	MGAINDEX_DRAW_YDSTLEN				      0x62
#define	MGAINDEX_DRAW_PITCH				      0x63
#define	MGAINDEX_DRAW_YDST				      0x64
#define	MGAINDEX_DRAW_YDSTORG				      0x65
#define	MGAINDEX_DRAW_YTOP				      0x66
#define	MGAINDEX_DRAW_YBOT				      0x67
#define	MGAINDEX_DRAW_CXLEFT				      0x68
#define	MGAINDEX_DRAW_CXRIGHT				      0x69
#define	MGAINDEX_DRAW_FXLEFT				      0x6a
#define	MGAINDEX_DRAW_FXRIGHT				      0x6b
#define	MGAINDEX_DRAW_XDST				      0x6c
#define	MGAINDEX_WIADDR					      0x70
#define	MGAINDEX_WFLAG					      0x71
#define	MGAINDEX_WGETMSB				      0x72
#define	MGAINDEX_WVRTXSZ				      0x73
#define	MGAINDEX_TMR0					      0x80
#define	MGAINDEX_TMR1					      0x81
#define	MGAINDEX_TMR2					      0x82
#define	MGAINDEX_TMR3					      0x83
#define	MGAINDEX_TMR4					      0x84
#define	MGAINDEX_TMR5					      0x85
#define	MGAINDEX_TMR6					      0x86
#define	MGAINDEX_TMR7					      0x87
#define	MGAINDEX_TMR8					      0x88
#define	MGAINDEX_TEXORG					      0x89
#define	MGAINDEX_TEXWIDTH				      0x8a
#define	MGAINDEX_TEXHEIGHT				      0x8b
#define	MGAINDEX_TEXCTL					      0x8c
#define	MGAINDEX_TEXTRANS				      0x8d
#define	MGAINDEX_TEXTRANSHIGH				      0x8e
#define	MGAINDEX_TEXCTL2				      0x8f
#define	MGAINDEX_SECADDRESS				      0x90
#define	MGAINDEX_SECEND					      0x91
#define	MGAINDEX_SOFTRAP				      0x92
#define	MGAINDEX_DWGSYNC				      0x93
#define	MGAINDEX_DR0_Z32_LSB				      0x94
#define	MGAINDEX_DR0_Z32_MSB				      0x95
#define	MGAINDEX_TEXFILTER				      0x96
#define	MGAINDEX_TEXBORDERCOL				      0x97
#define	MGAINDEX_DR2_Z32_LSB				      0x98
#define	MGAINDEX_DR2_Z32_MSB				      0x99
#define	MGAINDEX_DR3_Z32_LSB				      0x9a
#define	MGAINDEX_DR3_Z32_MSB				      0x9b
#define	MGAINDEX_ALPHASTART				      0x9c
#define	MGAINDEX_ALPHAXINC				      0x9d
#define	MGAINDEX_ALPHAYINC				      0x9e
#define	MGAINDEX_ALPHACTRL				      0x9f
#define	MGAINDEX_SPECRSTART				      0xa0
#define	MGAINDEX_SPECRXINC				      0xa1
#define	MGAINDEX_SPECRYINC				      0xa2
#define	MGAINDEX_SPECGSTART				      0xa3
#define	MGAINDEX_SPECGXINC				      0xa4
#define	MGAINDEX_SPECGYINC				      0xa5
#define	MGAINDEX_SPECBSTART				      0xa6
#define	MGAINDEX_SPECBXINC				      0xa7
#define	MGAINDEX_SPECBYINC				      0xa8
#define	MGAINDEX_TEXORG1				      0xa9
#define	MGAINDEX_TEXORG2				      0xaa
#define	MGAINDEX_TEXORG3				      0xab
#define	MGAINDEX_TEXORG4				      0xac
#define	MGAINDEX_SRCORG					      0xad
#define	MGAINDEX_DSTORG					      0xae
#define	MGAINDEX_SETUPADDRESS				      0xb4
#define	MGAINDEX_SETUPEND				      0xb5
#define	MGAINDEX_WR					      0xc0

typedef struct mga_struct {
	uint8_t mga_dmawin[0x1c00];			/* 0x0000 */
	uint32_t mga_dwgctl;				/* 0x1c00 */
	uint32_t mga_maccess;				/* 0x1c04 */
	uint32_t mga_mctlwtst;				/* 0x1c08 */
	uint32_t mga_zorg;				/* 0x1c0c */
	uint32_t mga_pat0;				/* 0x1c10 */
	uint32_t mga_pat1;				/* 0x1c14 */
	uint32_t mga_reserved_0x1c18;			/* 0x1c18 */
	uint32_t mga_plnwt;				/* 0x1c1c */
	uint32_t mga_bcol;				/* 0x1c20 */
	uint32_t mga_fcol;				/* 0x1c24 */
	uint32_t mga_reserved_0x1c28;			/* 0x1c28 */
	uint32_t mga_reserved_0x1c2c;			/* 0x1c2c */
	uint32_t mga_src0;				/* 0x1c30 */
	uint32_t mga_src1;				/* 0x1c34 */
	uint32_t mga_src2;				/* 0x1c38 */
	uint32_t mga_src3;				/* 0x1c3c */
	uint32_t mga_xystrt;				/* 0x1c40 */
	uint32_t mga_xyend;				/* 0x1c44 */
	uint32_t mga_reserved_0x1c48;			/* 0x1c48 */
	uint32_t mga_reserved_0x1c4c;			/* 0x1c4c */
	uint32_t mga_shift;				/* 0x1c50 */
	uint32_t mga_dmapad;				/* 0x1c54 */
	uint32_t mga_sgn;				/* 0x1c58 */
	uint32_t mga_len;				/* 0x1c5c */
	uint32_t mga_ar0;				/* 0x1c60 */
	uint32_t mga_ar1;				/* 0x1c64 */
	uint32_t mga_ar2;				/* 0x1c68 */
	uint32_t mga_ar3;				/* 0x1c6c */
	uint32_t mga_ar4;				/* 0x1c70 */
	uint32_t mga_ar5;				/* 0x1c74 */
	uint32_t mga_ar6;				/* 0x1c78 */
	uint32_t mga_reserved_0x1c7c;			/* 0x1c7c */
	uint32_t mga_cxbndry;				/* 0x1c80 */
	uint32_t mga_fxbndry;				/* 0x1c84 */
	uint32_t mga_ydstlen;				/* 0x1c88 */
	uint32_t mga_pitch;				/* 0x1c8c */
	uint32_t mga_ydst;				/* 0x1c90 */
	uint32_t mga_ydstorg;				/* 0x1c94 */
	uint32_t mga_ytop;				/* 0x1c98 */
	uint32_t mga_ybot;				/* 0x1c9c */
	uint32_t mga_cxleft;				/* 0x1ca0 */
	uint32_t mga_cxright;				/* 0x1ca4 */
	uint32_t mga_fxleft;				/* 0x1ca8 */
	uint32_t mga_fxright;				/* 0x1cac */
	uint32_t mga_xdst;				/* 0x1cb0 */
	uint32_t mga_reserved_0x1cb4;			/* 0x1cb4 */
	uint32_t mga_reserved_0x1cb8;			/* 0x1cb8 */
	uint32_t mga_reserved_0x1cbc;			/* 0x1cbc */
	uint32_t mga_dr0;				/* 0x1cc0 */
	uint32_t mga_fogstart;				/* 0x1cc4 */
	uint32_t mga_dr2;				/* 0x1cc8 */
	uint32_t mga_dr3;				/* 0x1ccc */
	uint32_t mga_dr4;				/* 0x1cd0 */
	uint32_t mga_fogxinc;				/* 0x1cd4 */
	uint32_t mga_dr6;				/* 0x1cd8 */
	uint32_t mga_dr7;				/* 0x1cdc */
	uint32_t mga_dr8;				/* 0x1ce0 */
	uint32_t mga_fogyinc;				/* 0x1ce4 */
	uint32_t mga_dr10;				/* 0x1ce8 */
	uint32_t mga_dr11;				/* 0x1cec */
	uint32_t mga_dr12;				/* 0x1cf0 */
	uint32_t mga_fogcol;				/* 0x1cf4 */
	uint32_t mga_dr14;				/* 0x1cf8 */
	uint32_t mga_dr15;				/* 0x1cfc */
	uint32_t mga_draw_dwgctl;			/* 0x1d00 */
	uint32_t mga_draw_maccess;			/* 0x1d04 */
	uint32_t mga_reserved_0x1d08;			/* 0x1d08 */
	uint32_t mga_draw_zorg;				/* 0x1d0c */
	uint32_t mga_draw_pat0;				/* 0x1d10 */
	uint32_t mga_draw_pat1;				/* 0x1d14 */
	uint32_t mga_reserved_0x1d18;			/* 0x1d18 */
	uint32_t mga_draw_plnwt;			/* 0x1d1c */
	uint32_t mga_draw_bcol;				/* 0x1d20 */
	uint32_t mga_draw_fcol;				/* 0x1d24 */
	uint32_t mga_reserved_0x1d28;			/* 0x1d28 */
	uint32_t mga_reserved_0x1d2c;			/* 0x1d2c */
	uint32_t mga_draw_src0;				/* 0x1d30 */
	uint32_t mga_draw_src1;				/* 0x1d34 */
	uint32_t mga_draw_src2;				/* 0x1d38 */
	uint32_t mga_draw_src3;				/* 0x1d3c */
	uint32_t mga_draw_xystrt;			/* 0x1d40 */
	uint32_t mga_draw_xyend;			/* 0x1d44 */
	uint32_t mga_reserved_0x1d48;			/* 0x1d48 */
	uint32_t mga_reserved_0x1d4c;			/* 0x1d4c */
	uint32_t mga_draw_shift;			/* 0x1d50 */
	uint32_t mga_draw_dmapad;			/* 0x1d54 */
	uint32_t mga_draw_sgn;				/* 0x1d58 */
	uint32_t mga_draw_len;				/* 0x1d5c */
	uint32_t mga_draw_ar0;				/* 0x1d60 */
	uint32_t mga_draw_ar1;				/* 0x1d64 */
	uint32_t mga_draw_ar2;				/* 0x1d68 */
	uint32_t mga_draw_ar3;				/* 0x1d6c */
	uint32_t mga_draw_ar4;				/* 0x1d70 */
	uint32_t mga_draw_ar5;				/* 0x1d74 */
	uint32_t mga_draw_ar6;				/* 0x1d78 */
	uint32_t mga_reserved_0x1d7c;			/* 0x1d7c */
	uint32_t mga_draw_cxbndry;			/* 0x1d80 */
	uint32_t mga_draw_fxbndry;			/* 0x1d84 */
	uint32_t mga_draw_ydstlen;			/* 0x1d88 */
	uint32_t mga_draw_pitch;			/* 0x1d8c */
	uint32_t mga_draw_ydst;				/* 0x1d90 */
	uint32_t mga_draw_ydstorg;			/* 0x1d94 */
	uint32_t mga_draw_ytop;				/* 0x1d98 */
	uint32_t mga_draw_ybot;				/* 0x1d9c */
	uint32_t mga_draw_cxleft;			/* 0x1da0 */
	uint32_t mga_draw_cxright;			/* 0x1da4 */
	uint32_t mga_draw_fxleft;			/* 0x1da8 */
	uint32_t mga_draw_fxright;			/* 0x1dac */
	uint32_t mga_draw_xdst;				/* 0x1db0 */
	uint32_t mga_reserved_0x1db4;			/* 0x1db4 */
	uint32_t mga_reserved_0x1db8;			/* 0x1db8 */
	uint32_t mga_reserved_0x1dbc;			/* 0x1dbc */
	uint32_t mga_wiaddr;				/* 0x1dc0 */
	uint32_t mga_wflag;				/* 0x1dc4 */
	uint32_t mga_wgetmsb;				/* 0x1dc8 */
	uint32_t mga_wvrtxsz;				/* 0x1dcc */
	uint8_t mga_reserved_0x1dd0[0x1e00 - 0x1dd0];	/* 0x1dd0 */
	uint32_t mga_reserved_0x1e00;			/* 0x1e00 */
	uint32_t mga_reserved_0x1e04;			/* 0x1e04 */
	uint32_t mga_reserved_0x1e08;			/* 0x1e08 */
	uint32_t mga_reserved_0x1e0c;			/* 0x1e0c */
	uint32_t mga_fifostatus;			/* 0x1e10 */
	uint32_t mga_status;				/* 0x1e14 */
	uint32_t mga_iclear;				/* 0x1e18 */
	uint32_t mga_ien;				/* 0x1e1c */
	uint32_t mga_vcount;				/* 0x1e20 */
	uint32_t mga_modelrev;				/* 0x1e24 */
	uint32_t mga_reserved_0x1e28;			/* 0x1e28 */
	uint32_t mga_reserved_0x1e2c;			/* 0x1e2c */
	uint32_t mga_dmamap30;				/* 0x1e30 */
	uint32_t mga_dmamap74;				/* 0x1e34 */
	uint32_t mga_dmamapb8;				/* 0x1e38 */
	uint32_t mga_dmamapfc;				/* 0x1e3c */
	uint32_t mga_rst;				/* 0x1e40 */
	uint32_t mga_memrdbk;				/* 0x1e44 */
	uint32_t mga_test0;				/* 0x1e48 */
	uint32_t mga_agp_pll;				/* 0x1e4c */
	uint32_t mga_primptr;				/* 0x1e50 */
	uint32_t mga_opmode;				/* 0x1e54 */
	uint32_t mga_primaddress;			/* 0x1e58 */
	uint32_t mga_primend;				/* 0x1e5c */
	uint32_t mga_wiaddrnb;				/* 0x1e60 */
	uint32_t mga_wflagnb;				/* 0x1e64 */
	uint32_t mga_wimemaddr;				/* 0x1e68 */
	uint32_t mga_wcodeaddr;				/* 0x1e6c */
	uint32_t mga_wmisc;				/* 0x1e70 */
	uint32_t mga_reserved_0x1e74;			/* 0x1e74 */
	uint32_t mga_reserved_0x1e78;			/* 0x1e78 */
	uint32_t mga_reserved_0x1e7c;			/* 0x1e7c */
	uint32_t mga_dwg_indir_wt[0x10];		/* 0x1e80 */
	uint8_t mga_reserved_0x1ec0[0x1fc0 - 0x1ec0];	/* 0x1ec0 */
	uint8_t mga_attr_index;				/* 0x1fc0 */
	uint8_t mga_attr_data;				/* 0x1fc1 */
	uint8_t mga_insts0;				/* 0x1fc2 */
	uint8_t mga_reserved_0x1fc3;			/* 0x1fc3 */
	uint8_t mga_seq_index;				/* 0x1fc4 */
	uint8_t mga_seq_data;				/* 0x1fc5 */
	uint8_t mga_reserved_0x1fc6;			/* 0x1fc6 */
	uint8_t mga_dacstatus;				/* 0x1fc7 */
	uint8_t mga_reserved_0x1fc8;			/* 0x1fc8 */
	uint8_t mga_reserved_0x1fc9;			/* 0x1fc9 */
	uint8_t mga_feat_read;				/* 0x1fca */
	uint8_t mga_reserved_0x1fcb;			/* 0x1fcb */
	uint8_t mga_miscout_read;			/* 0x1fcc */
	uint8_t mga_reserved_0x1fcd;			/* 0x1fcd */
	uint8_t mga_gctl_index;				/* 0x1fce */
	uint8_t mga_gctl_data;				/* 0x1fcf */
	uint8_t mga_reserved_0x1fd0;			/* 0x1fd0 */
	uint8_t mga_reserved_0x1fd1;			/* 0x1fd1 */
	uint8_t mga_reserved_0x1fd2;			/* 0x1fd2 */
	uint8_t mga_reserved_0x1fd3;			/* 0x1fd3 */
	uint8_t mga_crtc_index;				/* 0x1fd4 */
	uint8_t mga_crtc_data;				/* 0x1fd5 */
	uint8_t mga_reserved_0x1fd6;			/* 0x1fd6 */
	uint8_t mga_reserved_0x1fd7;			/* 0x1fd7 */
	uint8_t mga_reserved_0x1fd8;			/* 0x1fd8 */
	uint8_t mga_reserved_0x1fd9;			/* 0x1fd9 */
	uint8_t mga_insts1;				/* 0x1fda */
	uint8_t mga_reserved_0x1fdb;			/* 0x1fdb */
	uint8_t mga_reserved_0x1fdc;			/* 0x1fdc */
	uint8_t mga_reserved_0x1fdd;			/* 0x1fdd */
	uint8_t mga_crtcext_index;			/* 0x1fde */
	uint8_t mga_crtcext_data;			/* 0x1fdf */
	uint8_t mga_reserved_0x1fe0[0x1fff - 0x1fe0];	/* 0x1fe0 */
	uint8_t mga_cacheflush;				/* 0x1fff */
	uint32_t mga_wimemdata[0x20];			/* 0x2000 */
	uint8_t mga_reserved_0x2080[0x2c00 - 0x2080];	/* 0x2080 */
	uint32_t mga_tmr0;				/* 0x2c00 */
	uint32_t mga_tmr1;				/* 0x2c04 */
	uint32_t mga_tmr2;				/* 0x2c08 */
	uint32_t mga_tmr3;				/* 0x2c0c */
	uint32_t mga_tmr4;				/* 0x2c10 */
	uint32_t mga_tmr5;				/* 0x2c14 */
	uint32_t mga_tmr6;				/* 0x2c18 */
	uint32_t mga_tmr7;				/* 0x2c1c */
	uint32_t mga_tmr8;				/* 0x2c20 */
	uint32_t mga_texorg;				/* 0x2c24 */
	uint32_t mga_texwidth;				/* 0x2c28 */
	uint32_t mga_texheight;				/* 0x2c2c */
	uint32_t mga_texctl;				/* 0x2c30 */
	uint32_t mga_textrans;				/* 0x2c34 */
	uint32_t mga_textranshigh;			/* 0x2c38 */
	uint32_t mga_texctl2;				/* 0x2c3c */
	uint32_t mga_secaddress;			/* 0x2c40 */
	uint32_t mga_secend;				/* 0x2c44 */
	uint32_t mga_softrap;				/* 0x2c48 */
	uint32_t mga_dwgsync;				/* 0x2c4c */
	uint32_t mga_dr0_z32_lsb;			/* 0x2c50 */
	uint32_t mga_dr0_z32_msb;			/* 0x2c54 */
	uint32_t mga_texfilter;				/* 0x2c58 */
	uint32_t mga_texbordercol;			/* 0x2c5c */
	uint32_t mga_dr2_z32_lsb;			/* 0x2c60 */
	uint32_t mga_dr2_z32_msb;			/* 0x2c64 */
	uint32_t mga_dr3_z32_lsb;			/* 0x2c68 */
	uint32_t mga_dr3_z32_msb;			/* 0x2c6c */
	uint32_t mga_alphastart;			/* 0x2c70 */
	uint32_t mga_alphaxinc;				/* 0x2c74 */
	uint32_t mga_alphayinc;				/* 0x2c78 */
	uint32_t mga_alphactrl;				/* 0x2c7c */
	uint32_t mga_specrstart;			/* 0x2c80 */
	uint32_t mga_specrxinc;				/* 0x2c84 */
	uint32_t mga_specryinc;				/* 0x2c88 */
	uint32_t mga_specgstart;			/* 0x2c8c */
	uint32_t mga_specgxinc;				/* 0x2c90 */
	uint32_t mga_specgyinc;				/* 0x2c94 */
	uint32_t mga_specbstart;			/* 0x2c98 */
	uint32_t mga_specbxinc;				/* 0x2c9c */
	uint32_t mga_specbyinc;				/* 0x2ca0 */
	uint32_t mga_texorg1;				/* 0x2ca4 */
	uint32_t mga_texorg2;				/* 0x2ca8 */
	uint32_t mga_texorg3;				/* 0x2cac */
	uint32_t mga_texorg4;				/* 0x2cb0 */
	uint32_t mga_srcorg;				/* 0x2cb4 */
	uint32_t mga_dstorg;				/* 0x2cb8 */
	uint32_t mga_reserved_0x2cbc;			/* 0x2cbc */
	uint32_t mga_reserved_0x2cc0;			/* 0x2cc0 */
	uint32_t mga_reserved_0x2cc4;			/* 0x2cc4 */
	uint32_t mga_reserved_0x2cc8;			/* 0x2cc8 */
	uint32_t mga_reserved_0x2ccc;			/* 0x2ccc */
	uint32_t mga_setupaddress;			/* 0x2cd0 */
	uint32_t mga_setupend;				/* 0x2cd4 */
	uint8_t mga_reserved_0x2cd8[0x2d00 - 0x2cd8];	/* 0x2cd8 */
	uint32_t mga_wr[64];				/* 0x2d00 */
	uint8_t mga_reserved_0x2e00[0x3c00 - 0x2e00];	/* 0x2e00 */
	uint8_t mga_palwtadd;				/* 0x3c00 */
	uint8_t mga_paldata;				/* 0x3c01 */
	uint8_t mga_pixrdmsk;				/* 0x3c02 */
	uint8_t mga_palrdadd;				/* 0x3c03 */
	uint8_t mga_reserved_0x3c04;			/* 0x3c04 */
	uint8_t mga_reserved_0x3c05;			/* 0x3c05 */
	uint8_t mga_reserved_0x3c06;			/* 0x3c06 */
	uint8_t mga_reserved_0x3c07;			/* 0x3c07 */
	uint8_t mga_reserved_0x3c08;			/* 0x3c08 */
	uint8_t mga_reserved_0x3c09;			/* 0x3c09 */
	uint8_t mga_x_datareg;				/* 0x3c0a */
	uint8_t mga_reserved_0x3c0b;			/* 0x3c0b */
	uint8_t mga_curposxl;				/* 0x3c0c */
	uint8_t mga_curposxh;				/* 0x3c0d */
	uint8_t mga_curposyl;				/* 0x3c0e */
	uint8_t mga_curposyh;				/* 0x3c0f */
	uint8_t mga_reserved_0x3c10[0x3d00 - 0x3c10];	/* 0x3c10 */
	uint32_t mga_besa1org;				/* 0x3d00 */
	uint32_t mga_besa2org;				/* 0x3d04 */
	uint32_t mga_besb1org;				/* 0x3d08 */
	uint32_t mga_besb2org;				/* 0x3d0c */
	uint32_t mga_besa1corg;				/* 0x3d10 */
	uint32_t mga_besa2corg;				/* 0x3d14 */
	uint32_t mga_besb1corg;				/* 0x3d18 */
	uint32_t mga_besb2corg;				/* 0x3d1c */
	uint32_t mga_besctl;				/* 0x3d20 */
	uint32_t mga_bespitch;				/* 0x3d24 */
	uint32_t mga_beshcoord;				/* 0x3d28 */
	uint32_t mga_besvcoord;				/* 0x3d2c */
	uint32_t mga_beshiscal;				/* 0x3d30 */
	uint32_t mga_besviscal;				/* 0x3d34 */
	uint32_t mga_beshsrcst;				/* 0x3d38 */
	uint32_t mga_beshsrcend;			/* 0x3d3c */
	uint32_t mga_reserved_0x3d40;			/* 0x3d40 */
	uint32_t mga_reserved_0x3d44;			/* 0x3d44 */
	uint32_t mga_besv1wght;				/* 0x3d48 */
	uint32_t mga_besv2wght;				/* 0x3d4c */
	uint32_t mga_beshsrclst;			/* 0x3d50 */
	uint32_t mga_besv1srclst;			/* 0x3d54 */
	uint32_t mga_besv2srclst;			/* 0x3d58 */
	uint8_t mga_reserved_0x3d5c[0x3dc0 - 0x3d5c];	/* 0x3d5c */
	uint32_t mga_besglobctl;			/* 0x3dc0 */
	uint32_t mga_besstatus;				/* 0x3dc4 */
	uint8_t mga_reserved_0x3dc8[0x3e00 - 0x3dc8];	/* 0x3dc8 */
	uint32_t mga_vinctl0;				/* 0x3e00 */
	uint32_t mga_vinctl1;				/* 0x3e04 */
	uint32_t mga_vbiaddr0;				/* 0x3e08 */
	uint32_t mga_vbiaddr1;				/* 0x3e0c */
	uint32_t mga_vinaddr0;				/* 0x3e10 */
	uint32_t mga_vinaddr1;				/* 0x3e14 */
	uint32_t mga_vinnextwin;			/* 0x3e18 */
	uint32_t mga_vinctl;				/* 0x3e1c */
	uint32_t mga_reserved_0x3e20;			/* 0x3e20 */
	uint32_t mga_reserved_0x3e24;			/* 0x3e24 */
	uint32_t mga_reserved_0x3e28;			/* 0x3e28 */
	uint32_t mga_reserved_0x3e2c;			/* 0x3e2c */
	uint32_t mga_vstatus;				/* 0x3e30 */
	uint32_t mga_viclear;				/* 0x3e34 */
	uint32_t mga_vien;				/* 0x3e38 */
	uint32_t mga_reserved_0x3e3c;			/* 0x3e3c */
	uint32_t mga_codecctl;				/* 0x3e40 */
	uint32_t mga_codecaddr;				/* 0x3e44 */
	uint32_t mga_codechostptr;			/* 0x3e48 */
	uint32_t mga_codechardptr;			/* 0x3e4c */
	uint32_t mga_codeclcode;			/* 0x3e50 */
	uint8_t mga_reserved_0x3e54[0x4000 - 0x3e54];	/* 0x3e54 */
	} mga_t;					/* 0x4000 */

#define	mga_miscout_write	mga_insts0		/* 0x1fc2 */
#define	mga_feat_write		mga_insts1		/* 0x1fda */
#define	mga_dwg_indir_wt0	mga_dwg_indir_wt[0x0]	/* 0x1e80 */
#define	mga_dwg_indir_wt1	mga_dwg_indir_wt[0x1]	/* 0x1e84 */
#define	mga_dwg_indir_wt2	mga_dwg_indir_wt[0x2]	/* 0x1e88 */
#define	mga_dwg_indir_wt3	mga_dwg_indir_wt[0x3]	/* 0x1e8c */
#define	mga_dwg_indir_wt4	mga_dwg_indir_wt[0x4]	/* 0x1e90 */
#define	mga_dwg_indir_wt5	mga_dwg_indir_wt[0x5]	/* 0x1e94 */
#define	mga_dwg_indir_wt6	mga_dwg_indir_wt[0x6]	/* 0x1e98 */
#define	mga_dwg_indir_wt7	mga_dwg_indir_wt[0x7]	/* 0x1e9c */
#define	mga_dwg_indir_wt8	mga_dwg_indir_wt[0x8]	/* 0x1ea0 */
#define	mga_dwg_indir_wt9	mga_dwg_indir_wt[0x9]	/* 0x1ea4 */
#define	mga_dwg_indir_wta	mga_dwg_indir_wt[0xa]	/* 0x1ea8 */
#define	mga_dwg_indir_wtb	mga_dwg_indir_wt[0xb]	/* 0x1eac */
#define	mga_dwg_indir_wtc	mga_dwg_indir_wt[0xc]	/* 0x1eb0 */
