oracle/solaris-userland/components/x11/app/gfx-utils/sun-src/fbconfig/fbconfig.8
'\" te
.\" Copyright (c) 2009, 2014, Oracle and/or its affiliates. All rights reserved.
.TH fbconfig 8 "10 Sep 2014" "Solaris 11.4" "System Administration Commands"
.SH NAME
fbconfig \- frame buffer configuration utility
.SH SYNOPSIS

.LP
.nf
\fBfbconfig\fR [\fB-dev\fR \fIdevice_file\fR] [\fB-help\fR]
.fi

.LP
.nf
\fBfbconfig\fR \fB-list\fR
.fi

.LP
.nf
\fBfbconfig\fR \fB-gui\fR
.fi

.LP
.nf
\fBfbconfig\fR \fB-res\fR \e?
.fi

.LP
.nf
fbconfig [-dev \fIdevice_file\fR] [-file machine | system | \fIconfig-path\fR]
        [\fIdevice_specific_options\fR] [-res video-mode [nocheck | noconfirm]]
 	  [-defaults] [-prconf] [-prdid [raw] [parsed]] [-propt]
.fi
.SH DESCRIPTION
.sp
.LP
\fBfbconfig\fR is the generic command line interface to query and/or to configure a frame buffer device. Depending on the command line options, \fBfbconfig\fR can invoke a device-specific configuration program which accepts additional options beyond those shown here.
.SH OPTIONS
.sp
.LP
The following options are supported for all frame buffer devices:
.sp
.ne 2
.mk
.na
\fB\fB-defaults\fR\fR
.ad
.br
.sp .6
.RS 4n
Sets configuration options for the specified device to their default values. This does not affect the \fB-res\fR video mode setting. See the device-specific portions of the \fBDEFAULTS\fR section below.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-dev\fR \fIdevice-file\fR\fR
.ad
.br
.sp .6
.RS 4n
Specifies the frame buffer device by either its full pathname or simple filename (for example, \fB/dev/fbs/efb0\fR or \fBefb0\fR). Pathnames of installed devices can be displayed using the \fB-list\fR option to \fBfbconfig\fR. If the \fB-dev\fR option is omitted, the default device, \fB/dev/fb\fR, is used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-file\fR \fBmachine\fR | \fBsystem\fR | \fIconfig-path\fR\fR
.ad
.br
.sp .6
.RS 4n
Specifies which \fBxorg.conf\fR file to open. If \fBmachine\fR is specified, the machine-specific \fB/etc/X11/xorg.conf\fR file is opened. If system is specified, the global \fB/usr/lib/X11/xorg.conf\fR file is opened. The absolute pathname of a configuration file can be used instead. If the specified file does not exist and is to be updated, it is created. The file system that contains the \fBxorg.conf\fR file must be writeable by someone with superuser-like privileges. This option has no effect unless other options are specified. The default is \fBmachine\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-help\fR\fR
.ad
.br
.sp .6
.RS 4n
Displays the supported \fBfbconfig\fR command line options, along with a brief explanation of each. Also displays the \fB-help\fR text of the device-specific configuration program, if any. The frame buffer device can be specified using the \fB-dev\fR option, otherwise the default is used. Other \fBfbconfig\fR options are ignored. This is the default \fBfbconfig\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-list\fR\fR
.ad
.br
.sp .6
.RS 4n
Displays the pathnames of the installed frame buffer devices, the device model of each, and the configuration program that would be invoked for each device with the currently configured X server. Other \fBfbconfig\fR options are ignored.
.sp
.sp
.in +2
.nf
Device File Name            Device Model     Config Program
----------------            ------------     --------------
/dev/fbs/nfb0 [a|b]         XVR-300          SUNWnfb_config
/dev/fbs/pfb0 [a|b]         XVR-100          SUNWpfb_config
.fi
.in -2
.sp
Other supported options are determined by the device-specific configuration program:
.sp
.ne 2
.mk
.na
\fB\fIdevice-specific-options\fR\fR
.ad
.br
.sp .6
.RS 4n
The syntax and descriptions of additional device-specific options are displayed in the \fB-help\fR output of \fBfbconfig\fR or the device-specific program. They are also contained in the man page for the device-specific program.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-help\fR\fR
.ad
.br
.sp .6
.RS 4n
Display the \fBfbconf_xorg\fR command line options that are supported in conjunction with the frame buffer device, along with a brief explanation of each option. The frame buffer device can be specified using the \fB-dev\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-prconf\fR\fR
.ad
.br
.sp .6
.RS 4n
Display the current configuration for the frame buffer device and attached display device(s). The frame buffer device can be specified using the \fB-dev\fR option.
.sp
The \fB-prconf\fR output might resemble:
.sp
.in +2
.nf
Monitor/Resolution Information:
    Monitor manufacturer: SUN
    Product Code:  4
    Serial Number: 12212555
    Manufacture date: 2000, week 9
    EDID Version:  1.1
    Monitor dimensions: 36x29 cm
    Default Gamma: 2.62
    Monitor preferred resolution: SUNW_STD_1280x1024x60
    Monitor supported resolutions from EDID: SUNW_STD_1280x1024x60,
        SUNW_STD_1280x1024x76, 1152x900x66, VESA_STD_1280x1024x75,
        VESA_STD_1280x1024x60, SUNW_STD_1152x900x66,
        VESA_STD_720x400x70, VESA_STD_640x480x60,
        VESA_STD_640x480x67, VESA_STD_640x480x72,
        VESA_STD_640x480x75, VESA_STD_800x600x56,
        VESA_STD_800x600x60, VESA_STD_800x600x72,
        VESA_STD_800x600x75, VESA_STD_832x624x75,
        VESA_STD_1024x768x60, VESA_STD_1024x768x70, 1024x768x75
    Current resolution setting: FALLBACK_1152x900x66

Framelock Configuration:
    Slave Mode: Disabled
.fi
.in -2
.sp
.RE

.sp
.ne 2
.mk
.na
\fB\fB-predid\fR [\fBraw\fR] [\fBparsed\fR]\fR
.ad
.br
.sp .6
.RS 4n
Display the E-EDID (Enhanced Extended Display Identification Data) information obtained from the display device(s), which must be online, connected to the frame buffer. The frame buffer device can be specified using the \fB-dev\fR option. The output is raw hexadecimal and/or human-readable (parsed) text. The default is parsed.
.sp
The \fB-predid\fR raw output might resemble:
.sp
.in +2
.nf
--- EDID Data for /dev/fbs/kfb0 ---

Block 0: EDID Base Block
        0x00:  00 FF FF FF FF FF FF 00 04 43 06 F2 01 00 00 00
        0x10:  01 11 01 04 0F 2B 20 78 2B 9C 68 A0 57 4A 9B 26
        0x20:  12 48 4C FF FF 80 A9 59 A9 4F A9 4A A9 45 81 99
        0x30:  81 80 61 59 45 59 48 3F 40 30 62 B0 32 40 40 C0
        0x40:  13 00 AB 40 11 00 00 1E 00 00 00 FD 00 32 5A 1E
        0x50:  6E 17 04 11 00 C8 90 00 50 3C 00 00 00 F7 00 0A
        0x60:  F7 0F 03 87 C0 00 00 00 00 00 00 00 00 00 00 FC
        0x70:  00 41 42 43 20 4C 43 44 32 31 0A 20 20 20 00 0B
.fi
.in -2
.sp
.RE

.sp
.ne 2
.mk
.na
\fB\fB-propt\fR\fR
.ad
.br
.sp .6
.RS 4n
Display all option settings for the frame buffer device, either as they currently are or as they are represented in the \fBxorg.conf\fR configuration file when \fBfbconf_xorg\fR completes. The device can be specified using the \fB-dev\fR option, and the file using the \fB-file\fR option.
.sp
The \fB-propt\fR output might resemble:
.sp
.in +2
.nf


--- Graphics Configuration for /dev/fbs/efb0 ---

xorg.conf: machine -- /etc/X11/xorg.conf
	  Screen section:  "efb0"
	  Device section:  "efb0"
	  Monitor section: none

Video Mode: Not set

Screen Information:
	  DoubleWide: Disable
	  DoubleHigh: Disable
	  Clone: Disable
	  Offset/Overlap: [0, 0]
	  Outputs:        Direct

Visual Information:
	  Gamma Correction: Using default gamma value 2.22


.fi
.in -2
.sp
.RE

.sp
.ne 2
.mk
.na
\fB\fB-res\fR \fB?\fR\fR
.ad
.br
.sp .6
.RS 4n
Display a list of video modes that can be used with the \fB-res\fR  \fIvideo-mode\fR option.
.sp
The \fB?\fR argument might need to be escaped or placed in quotes (\fB\e?, "?", or '?'\fR), to protect it from misinterpretation by the shell.
.sp
The \fB-res\fR  \fB?\fR output might resemble:
.sp
.sp
.in +2
.nf
           Video modes accepted by the -res option:
                AUTO                      [1][2]
                NONE                      [1][2]
                SUNW_STD_1920x1200x75
                SUNW_STD_1920x1200x70
                SUNW_DIG_1920x1200x60
                SUNW_STD_1920x1080x72
                SUNW_DIG_1920x1080x60
                  ...
                  ...
                VESA_STD_640x480x75       [1]
                VESA_STD_640x480x72       [1]
                VESA_STD_640x480x60       [1]

           [1] Resolution is supported by monitor
           [2] Preferred resolution for monitor
.fi
.in -2
.sp
Abbreviations such as "\fB1280x1024x75\fR" might also be used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-res\fR \fIvideo-mode\fR [\fBnocheck\fR | \fBnoconfirm\fR]\fR
.ad
.br
.sp .6
.RS 4n
Set the video mode for the display device that is connected to the frame buffer device.
.sp
A list of video modes can be displayed using the \fB-res\fR  \fB?\fR option.
.sp
The basic format of a video-mode is \fIwidth\fRx\fIheight\fRx\fIrate\fR, where:
.sp
.RS +4
.TP
.ie t \(bu
.el o
\fIwidth\fR is the screen width in pixels.

.RE
.RS +4
.TP
.ie t \(bu
.el o
\fIheight\fR is the screen height in pixels.

.RE
.RS +4
.TP
.ie t \(bu
.el o
\fIrate\fR is the vertical frequency of the screen refresh.

.RE
A video-mode argument might have an \fB@\fR (at sign) instead of \fBx\fR preceding the refresh rate. For instance, \fB1280x1024x76\fR and \fB1280x1024@76\fR are equivalent.
.sp
A video-mode name might carry additional information, as with \fBSUNW_STD_1280x1024x76\fR.
.sp
The \fB-res\fR argument, \fBauto\fR, represents the video mode that is currently programmed into the device. The argument, \fBnone\fR, is a synonym for \fBauto\fR.
.sp
Note that some video modes might be inappropriate for certain frame buffer devices and/or display devices.
.sp
The \fB-res\fR option accepts suboption keywords following the video-mode specification.
.sp
.ne 2
.mk
.na
\fB\fBnocheck\fR\fR
.ad
.br
.sp .6
.RS 4n
The \fBnocheck\fR suboption causes the video-mode argument to be accepted, regardless of whether it is supported by the currently attached monitor, whether it is known within the current configuration, and so forth. Note that using an unchecked, inappropriate video mode can leave the system without usable video output. This suboption is useful if a different monitor is to be connected to the frame buffer device. This suboption also implies \fBnoconfirm\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnoconfirm\fR\fR
.ad
.br
.sp .6
.RS 4n
If the video-mode argument is unable to be validated, the default action is to display a warning message and ask the user whether to continue. The \fBnoconfirm\fR suboption suppresses this confirmation request. This suboption is useful when \fBfbconf_xorg\fR is being run from a shell script.
.RE

.RE

.sp
.LP
The following device-specific options are supported for certain frame buffer devices. Unless specified otherwise, these options do not take effect until the user logs out and back in.
.sp
.ne 2
.mk
.na
\fB\fB-deflinear\fR \fBtrue\fR | \fBfalse\fR\fR
.ad
.br
.sp .6
.RS 4n
This option selects the default X visual. Two types of visuals are supported, linear and nonlinear. Linear visuals are gamma corrected. Nonlinear visuals are not.
.sp
If the value of this option is \fBtrue\fR, the default visual is set to default depth 24 and the default class is \fBTrueColor\fR with gamma correction enabled. If \fBfalse\fR, a nonlinear visual that satisfies the other default visual selection options, such as the default depth and default class, is chosen as the default visual.
.sp
The \fB-deflinear\fR, \fB-defoverlay\fR, and \fB-deftransparent\fR options each select the default X visual. Only one of these might be enabled at a time. Enabling one causes the others to be disabled.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-defoverlay\fR \fBtrue\fR | \fBfalse\fR\fR
.ad
.br
.sp .6
.RS 4n
This option selects the default X visual. Some devices might provide an 8-bit PseudoColor visual whose pixels are disjoint from the rest of the visuals. This is called the overlay visual. Windows created in this visual does not damage windows created in other visuals. The converse, however, is not true: Windows created in other visuals damage overlay windows.
.sp
If the value of this option is \fBtrue\fR, the overlay visual is the default visual. The default depth is 8-bit and the default class is PseudoColor. If \fBfalse\fR, the non-overlay visual that satisfies the other default visual selection options, such as the default depth and the default class, is chosen as the default visual.
.sp
The \fB-deflinear\fR, \fB-defoverlay\fR, and \fB-deftransparent\fR options each select the default X visual. Only one of these might be enabled at a time. Enabling one causes the others to be disabled.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-deftransparent\fR \fBtrue\fR | \fBfalse\fR\fR
.ad
.br
.sp .6
.RS 4n
This option selects the default X visual. Some devices might provide an 8-bit PseudoColor visual whose pixels are disjoint from the rest of the visuals. This is called the overlay visual. Windows created in this visual does not damage windows created in other visuals.
.sp
If the value of this option is \fBtrue\fR, the overlay visual used as the default is a transparent overlay visual. A visual with transparency supports a colormap with 255 colors and one transparent pixel. The default depth is 8-bit and the default class is PseudoColor. If \fBfalse\fR, the nonoverlay visual that satisfies the other default visual selection options, such as the default depth and the default class, is chosen as the default visual.
.sp
The \fB-deflinear\fR, \fB-defoverlay\fR, and \fB-deftransparent\fR options each select the default X visual. Only one of these might be enabled at a time. Enabling one causes the others to be disabled.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-doublehigh\fR \fBenable\fR | \fBdisable\fR\fR
.ad
.br
.sp .6
.RS 4n
Configures the two outputs of the frame buffer device into one vertical virtual display. The default is \fBdisable\fR. The \fB-doublewide\fR and \fB-doublehigh\fR options are mutually exclusive. Enabling one causes the other to be disabled.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-doublewide\fR \fBenable\fR | \fBdisable\fR\fR
.ad
.br
.sp .6
.RS 4n
Configures the two outputs of the frame buffer device into one horizontal virtual display. The default is \fBdisable\fR. The \fB-doublewide\fR and \fB-doublehigh\fR options are mutually exclusive. Enabling one causes the other to be disabled.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgamma-correction-value\fR\fR
.ad
.br
.sp .6
.RS 4n
Sets the gamma correction value. All linear visuals provide gamma correction. The gamma correction value should be in the range, \fB0.1\fR to \fB10.0\fR. The default is \fB2.22\fR. This option can be used while the window system is running. Changing the gamma correction value affects all of the windows displayed by linear visuals.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-gfile\fR \fIgamma-correction-file\fR\fR
.ad
.br
.sp .6
.RS 4n
Loads the gamma correction table from the file specified by \fIgamma-correction-file\fR. This text file specifies the gamma correction values for the R, G, and B channels. Three consecutive values form an RGB triplet. For a \fBkfb\fR device, there must be exactly 256 RGB triplets. A value might be represented in hexadecimal, decimal, or octal format (for example, \fB0x3FF\fR, \fB1023\fR, or \fB01777\fR, respectively). Values are separated by one or more whitespace or new line characters. Comments begin with a hash sign character (\fB#\fR) and end at the end of the line.
.sp
You can load the gamma correction table with this option while the window system is running. The new gamma correction affects all the windows being displayed using the linear visuals. When gamma correction is done using a user-specified table, the gamma correction value (\fB-g\fR) is undefined. By default, the window system assumes a gamma correction value of \fB2.22\fR and loads the gamma table it creates corresponding to this value.
.sp
The following is an example of a \fIgamma-correction-file\fR file:
.sp
.in +2
.nf
             # Gamma Correction Table
             0x00 0x00 0x00
             0x01 0x01 0x01
             0x02 0x02 0x02
              ...  ...  ...
              ...  ...  ...
             0xFF 0xFF 0xFF
.fi
.in -2
.sp
.RE

.sp
.ne 2
.mk
.na
\fB\fB-multisample\fR \fBavailable\fR | \fBdisable\fR | \fBforceon\fR\fR
.ad
.br
.sp .6
.RS 4n
If set to disable, no multisample is possible. If set to available, multisample is possible but is selected on a per-window basis using a library interface. If set to \fBforceon\fR, all Sun OpenGL windows are rendered using multisampling. To query the number of samples used, specify the \fB-propt\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-offset\fR \fIx-val\fR \fIy-val\fR\fR
.ad
.br
.sp .6
.RS 4n
Adjusts the position of the specified stream by the value specified. This option is only implemented in \fB-doublewide\fR and \fB-doublehigh\fR modes. For \fB-doublewide\fR, use the \fIx-val\fR to position the rightmost stream. Negative is left (overlaps with the left stream). For \fB-doublehigh\fR, use the \fIy-val\fR to position the bottom stream. Negative is up (overlaps with top stream). The default is \fB[0,0]\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-samples\fR \fB1\fR | \fB2\fR | \fB4\fR | \fB8\fR | \fB16\fR\fR
.ad
.br
.sp .6
.RS 4n
Requests the number of samples to compute per display pixel. The requested number of samples per pixel is used if \fB-multisample\fR is not disabled and resources exist for the request. To query the number of samples used, specify the \fB-propt\fR option or run the \fBxglinfo\fR utility. The \fBxglinfo\fR utility can return the number of multisamples after you specify the option \fB-multisample\fR available. The default is \fB4\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-slave\fR \fBdisable\fR | \fBmultiview\fR\fR
.ad
.br
.sp .6
.RS 4n
If you set the \fBmultiview\fR argument for the \fB-slave\fR option, the device synchronizes video with a master through the multiview genlock ribbon cable. The system should be powered off whenever connecting or disconnecting this cable. Both devices should be running the same resolution and the option should be issued when the window system is running. The default is \fBdisable\fR.
.RE

.SH DEFAULTS
.sp
.LP
Certain options have implied default arguments. The default argument is used when the option is not present on the \fBfbconf_xorg\fR command line. For instance, a default argument for \fB-dev\fR is \fB/dev/fb\fR.
.sp
.LP
Options that set configuration state do not have implied defaults. The \fB-res\fR option is one example. If a configuration option is omitted from the \fBfbconf_xorg\fR command line, the corresponding \fBxorg.conf\fR configuration setting remains unchanged. The exception is that if configuration options are mutually exclusive, setting one automatically unsets each of the others. An example is \fB-deflinear\fR, \fB-defoverlay\fR, and \fB-deftransparent\fR.
.sp
.LP
If a configuration setting is not present in the configuration file when the window system is run, a default value is used. For instance, the default state associated with \fB-res\fR is \fBauto\fR. A setting might not be present in the file, or the file itself might not exist, until \fBfbconf_xorg\fR has been invoked with the corresponding command line option.
.sp
.LP
The \fB-defaults\fR option sets the default values for most configuration settings.
.sp
.LP
Options and their defaults are shown below.
.sp
.LP
Device-independent defaults:
.sp
.in +2
.nf
             Option            Default Argument
             -dev              /dev/fb
             -file             machine

             Option            Default State
             -res              auto
.fi
.in -2
.sp
.SH EXAMPLES
.LP
\fBExample 1\fR Switching the Resolution of the Monitor Type

.sp
.LP
The following example sets the video mode for the monitor on the \fB/dev/fbs/efb0\fR device to 1280 x 1024 at 76 Hz:

.sp
.in +2
.nf
example% fbconf_xorg -dev efb0 -res 1280x1024x76
.fi
.in -2
.sp
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.br
.sp .6
.RS 4n
Execution completed successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.br
.sp .6
.RS 4n
Invalid command line usage.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.br
.sp .6
.RS 4n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/fb\fR\fR
.ad
.br
.sp .6
.RS 4n
Symbolic link to the default frame buffer device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/fbs/efbn\fIn\fR\fR\fR
.ad
.br
.sp .6
.RS 4n
Device special file for an \fBefb\fR frame buffer
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/fbconfig/SunModes_xorg.conf\fR\fR
.ad
.br
.sp .6
.RS 4n
Video mode definitions included in new configuration files.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
Availabilitysystem/graphics/fbconfig
_
Interface StabilityUncommitted
.TE
.sp
.SH SEE ALSO
.sp
.LP
\fBXorg\fR(1), \fBXserver\fR(1), \fBfbio\fR(4I), \fBattributes\fR(7), \fBsvccfg\fR(8)
